# MechanicalSystemType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalSystemType Class
Members See Also
---
Base class for duct system types
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class MechanicalSystemType : MEPSystemType
```

Visual Basic
---
```text
Public Class MechanicalSystemType _
	Inherits MEPSystemType
```

Visual C++
---
```text
public ref class MechanicalSystemType : public MEPSystemType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..MEPSystemType Autodesk.Revit.DB.Mechanical..::..MechanicalSystemType
# See Also
MechanicalSystemType Members
Autodesk.Revit.DB.Mechanical Namespace